frontend/modules/report/views/report/runreport4.php

SELECT * FROM `hdc`.`campur` WHERE changwatcode=0 ORDER BY `ampurcodefull`
---
      <div class="form-group">
        <?= Html::label('อำเภอ','campur');?>
        <?= Html::dropDownList('campur',$campur,
            ArrayHelper::map(Campur::find()
                ->where('changwatcode='.$provincecode)
                ->orderBy('ampurcodefull ASC')
                ->all(),'ampurcodefull','ampurname'),