frontend/modules/report/views/report/runreport.php

    try {
     $campur = $_GET['campur'];
     $ctambon = $_GET['ctambon'];
      $ctambon_list = ArrayHelper::map(Chospital::find()
            ->where('CONCAT(provcode,distcode)=:pcu', [':pcu'=>$campur])
            ->andWhere([
            'hostype' => ['03','04','05','06','07','08','12','13','15','18'],
            ])->all(), 'hoscode', 'hosname');
---
SELECT * FROM `chospital` WHERE (CONCAT(provcode,distcode)='7301') AND (`hostype` IN ('03', '04', '05', '06', '07', '08', '12', '13', '15', '18'))

        <div class="form-group">
        <?= Html::label('อำเภอ','campur');?>
        <?= Html::dropDownList('campur',$campur,
            ArrayHelper::map(Campur::find()
                ->where('changwatcode='.$provincecode)
                ->orderBy('ampurcodefull ASC')
                ->all(),'ampurcodefull','ampurname'),
---
SELECT * FROM `hdc`.`campur` WHERE changwatcode=73 ORDER BY `ampurcodefull`