frontend/modules/report/views/report/runreport2.php

      if($mastertype=='02'){
     $campur = $mastercode;
    // $ctambon = $_GET['ctambon'];
      $ctambon_list = ArrayHelper::map(Chospital::find()
            ->where('CONCAT(provcode,distcode)=:pcu', [':pcu'=>$campur])
            ->andWhere([
            'hostype' => ['03','04','05','06','07','08','12','13','15','18'],
            ])->all(), 'hoscode', 'hosname');
---
SELECT * FROM `chospital` WHERE (CONCAT(provcode,distcode)='7301') AND (`hostype` IN ('03', '04', '05', '06', '07', '08', '12', '13', '15', '18'))


         //  $ctambon = $_GET['ctambon'];

 $subhos_list= Cmastercup::find()->select('hsub')->where('hmain=:mastercode', [':mastercode'=>$campur])->all();
 for($i=0;$i<sizeof($subhos_list);$i++){
            $s[]=$subhos_list[$i]['hsub'];
        }
  $ctambon_list = ArrayHelper::map(Chospital::find()
             ->where(['IN', 'hoscode', $s])
              ->andWhere([
              'hostype' => ['03','04','05','06','07','08','12','13','15','18'],])
              ->all(), 'hoscode', 'hosname');
---
SELECT `hsub` FROM `cmastercup` WHERE hmain='10679'
SELECT * FROM `chospital` WHERE (`hoscode` IN ('08322', '08323', '08324', '08325', '08326', '08327', '08328', '08329', '08330', '08331', '08332', '08333', '08334', '08335', '08336', '08337', '08338', '08339', '08340', '08341', '08342', '08343', '08344', '08345', '08346', '08347', '08348', '08349', '08350', '08351', '08357', '08358', '08405', '08440', '08441', '10679', '12458', '14331', '14870', '22750', '23916', '25055', '28863', '40751', '40755', '77605', '77645')) AND (`hostype` IN ('03', '04', '05', '06', '07', '08', '12', '13', '15', '18'))