frontend/themes/lte/views/layouts/main.php

SELECT * FROM `sys_config`
---
<?php $this->beginBody() ?>
<?php
$hospcode=null;$tasks_noti=null;$g=null;$s=null;$offname=null;
$modelcon = SysConfig::find()->select('*')->one();

SELECT `n`.`snt_id`, `n`.`hospcode`, `n`.`distcode`, `n`.`hmain`, (SUM(y_cases)/SUM(total))*100 AS percent, `r`.`report_id`, `r`.`report_name`, `r`.`s_table` FROM `sys_Notifications` `n` LEFT JOIN `sys_report` `r` ON n.report_id=r.report_id WHERE  distcode ='7301'  AND n.y_cases<>0 AND r.active=1 GROUP BY `report_id` ORDER BY `percent` DESC
---
          $w='n.y_cases<>0 AND r.active=1';
        }else{$w=$office.' AND n.y_cases<>0 AND r.active=1';}

$tasks_noti= (new \yii\db\Query())
              ->select($s)
              ->from('sys_Notifications n')
              ->leftJoin('sys_report r', 'n.report_id=r.report_id')
              ->where($w)
              ->addParams([':h' => $hospcode])
              ->groupBy($g)
              ->orderBy(['percent' => SORT_DESC,])
              ->all(\Yii::$app->db);

SELECT * FROM `sys_report` WHERE (menu_group ='person') AND (active = 1)
SELECT COUNT(*) FROM `sys_report` WHERE (menu_group ='person') AND (active = 1)
---
                                    $im=1;

                     foreach ($modelmenu as &$value) {
                      $modelreport=SysReport::find()
                      ->where('menu_group =:mucode', [':mucode' => $value['mucode']])
                      ->andWhere('active = :active', [':active' => 1])
                      ->all();

                      $mcount = SysReport::find()
                      ->where('menu_group =:mucode', [':mucode' => $value['mucode']])
                      ->andWhere('active = :active', [':active' => 1])

SELECT count(report_id) AS report_id FROM `sys_Notifications` WHERE (`report_group`='person') AND (y_cases <> 0)
SELECT count(report_id) AS report_id FROM `sys_Notifications` WHERE (( distcode ='7301' ) AND (`report_group`='person')) AND (y_cases <> 0)
---
                if(!Yii::$app->user->isGuest){
                  $mgroup=$value['mucode'];
                  if(Yii::$app->user->identity->level==1||Yii::$app->user->identity->level=='01'){
                    $noti_group= SysNotifications::find()
                  ->select('count(report_id) AS report_id')
                   ->where(['report_group'=>$mgroup,
                    ])
                  ->andWhere('y_cases <> :y_cases', [':y_cases' => 0])
                  ->one();

                  }else{
                     $noti_group= SysNotifications::find()
                  ->select('count(report_id) AS report_id')
                   ->where($office)
                  ->addParams([':h' => $hospcode])
                   ->andWhere(['report_group'=>$mgroup])
                  ->andWhere('y_cases <> :y_cases', [':y_cases' => 0])
                  ->one();

SELECT SUM(y_cases) AS y_cases FROM `sys_Notifications` WHERE `report_id`=21
SELECT SUM(y_cases) AS y_cases FROM `sys_Notifications` WHERE ( distcode ='7301' ) AND (`report_id`=10011)
---
                if(!Yii::$app->user->isGuest){ ////////////////////////ยอดตัวเลขy_casesข้างเมนู
                  $reportid=$modelreport[$i]['report_id'];
                   if(Yii::$app->user->identity->level==1||Yii::$app->user->identity->level=='01'){
                     $noti_group= SysNotifications::find()
                  ->select('SUM(y_cases) AS y_cases')
                  ->where(['report_id'=>$reportid])
                  ->one();
                   }else{

                  $noti_group= SysNotifications::find()
                  ->select('SUM(y_cases) AS y_cases')
                  ->where($office)
                  ->addParams([':h' => $hospcode])
                  ->andWhere(['report_id'=>$reportid
                    ])
                  ->one();