frontend/modules/report/controllers/ReportController.php

    public static function chkcup(){
     $listmaincup='';
      $pmodel=SysConfig::find()->select('province_config')->one();
---
SELECT `province_config` FROM `sys_config`

    public function actionIndex()
    {
      $connection = \Yii::$app->db;
      $transaction = $connection->beginTransaction();
try {
      try{


        $data_notify=null;$ridnot=null;$notify_topten=null;
        $list_cup=$this->chkcup();
        $chkdata_notify = (new \yii\db\Query())
              ->select('*')
              ->from('sys_Notifications')
              ->all(\Yii::$app->db);
        $chkdata_notify=count($chkdata_notify);
        if($data_notify==null && $chkdata_notify==0){//isguest
              $data_notify = (new \yii\db\Query())
              ->select("report_id,report_name")
              ->from('sys_report')
              ->where(['active' => 1])
              ->limit(20)
              ->all(\Yii::$app->db);
---
SELECT * FROM `sys_Notifications`
SELECT `report_id`, `report_name` FROM `sys_report` WHERE `active`=1 LIMIT 20

     public function chk_province(){

        $model = SysConfig::find()->select('province_config')->one();
---
SELECT `province_config` FROM `sys_config`

    public function actionRunreport4(){

         $para='';
         $aum='';
         $chartwhere='';
         $hosname='';
         $cases='';
         $table=null;
          if (isset($_GET['r_table'])) {
              $tableid=$_GET['r_table'];
              $connection2 = Yii::$app->db;
           $findreport = SysReport::find()->where(['report_id' => $tableid])->one();
---
SELECT * FROM `sys_report` WHERE `report_id`='1'

     public function actionRunreport2()
    {
      $list_cup=$this->chkcup();
       if(in_array(Yii::$app->user->identity->hospcode, $list_cup, TRUE)||Yii::$app->user->identity->level=='02'){ //cup
         $para='';
         $aum='';
         $chartwhere='';
         $hosname='';
         $cases='';

         $mastercode=Yii::$app->user->identity->hospcode;
         $mastertype=Yii::$app->user->identity->level;
        if (isset($_GET['r_table'])) {
        $tableid=$_GET['r_table'];
     $connection2 = Yii::$app->db;
     $findreport = SysReport::find()->where(['report_id' => $tableid])->one();
---
SELECT * FROM `sys_report` WHERE `report_id`='10007'

             }
       }else{

         $subhos_list= Cmastercup::find()->select('hsub')->where('hmain=:mastercode', [':mastercode'=>$mastercode])->all();
---
SELECT `hsub` FROM `cmastercup` WHERE hmain='10679'

    public function actionRunreport1()
    {
       if(Yii::$app->user->identity->level==1 || Yii::$app->user->identity->level==2){
         $para='';
         $aum='';
         $chartwhere='';
         $hosname='';
         $cases='';

        if (isset($_GET['r_table'])) {
        $tableid=$_GET['r_table'];
     $connection2 = Yii::$app->db;

     $findreport = SysReport::find()->where(['report_id' => $tableid])->one();
---
SELECT * FROM `sys_report` WHERE `report_id`='12'